In [4]:
import pandas as pd 
location =pd.DataFrame({'arae':['new-york','columbo','mumbai']})
food =pd.DataFrame({'food':['pizza','crabs','vada-paw']})
det=pd.concat([location,food],join='outer',axis=1)
print(det)

       arae      food
0  new-york     pizza
1   columbo     crabs
2    mumbai  vada-paw

In [8]:
engg=pd.read_csv('C:\\Users\\kundrasu\\Documents\\dat2.csv')
sci=pd.read_csv('C:\\Users\\kundrasu\\Documents\\dat2.csv')
exam=pd.read_csv('C:\\Users\\kundrasu\\Documents\\dat2.csv')
student_exam=pd.read_csv('C:\\Users\\kundrasu\\Documents\\dat2.csv')

In [9]:
student_exam

   ind       Num1  Num2
0    1      2.000    33
1    2     33.500    44
2    3     44.500    55
3    4    555.600    66
4    5   6666.700    77
5    6  88880.400   888
6    7   9999.333  9999

In [11]:
student_exam.merge(engg,on='Num2')

   ind_x     Num1_x  Num2  ind_y     Num1_y
0      1      2.000    33      1      2.000
1      2     33.500    44      2     33.500
2      3     44.500    55      3     44.500
3      4    555.600    66      4    555.600
4      5   6666.700    77      5   6666.700
5      6  88880.400   888      6  88880.400
6      7   9999.333  9999      7   9999.333